In [1]:
import pandas as pd

In [2]:
df = pd.read_csv("titanic.csv")
df.head()

,PassengerId,Name,Pclass,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked,Survived
0,1,"Braund, Mr. Owen Harris",3,male,22.0,1,0,A/5 21171,7.2500,NaN,S,0
1,2,"Cumings, Mrs. John Bradley (Florence Briggs Th...",1,female,38.0,1,0,PC 17599,71.2833,C85,C,1
2,3,"Heikkinen, Miss. Laina",3,female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S,1
3,4,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",1,female,35.0,1,0,113803,53.1000,C123,S,1
4,5,"Allen, Mr. William Henry",3,male,35.0,0,0,373450,8.0500,NaN,S,0

In [3]:
df = df[["Pclass", "Sex", "Age", "Fare", "Survived"]]
df

     Pclass     Sex   Age     Fare  Survived
0         3    male  22.0   7.2500         0
1         1  female  38.0  71.2833         1
2         3  female  26.0   7.9250         1
3         1  female  35.0  53.1000         1
4         3    male  35.0   8.0500         0
..      ...     ...   ...      ...       ...
886       2    male  27.0  13.0000         0
887       1  female  19.0  30.0000         1
888       3  female   NaN  23.4500         0
889       1    male  26.0  30.0000         1
890       3    male  32.0   7.7500         0

[891 rows x 5 columns]

In [6]:
target = df["Survived"]
features = df[["Pclass", "Sex", "Age", "Fare"]]
# target

In [8]:
dummies = pd.get_dummies(features)
features = dummies[["Pclass", "Age", "Fare", "Sex_female"]]
features

     Pclass   Age     Fare  Sex_female
0         3  22.0   7.2500           0
1         1  38.0  71.2833           1
2         3  26.0   7.9250           1
3         1  35.0  53.1000           1
4         3  35.0   8.0500           0
..      ...   ...      ...         ...
886       2  27.0  13.0000           0
887       1  19.0  30.0000           1
888       3   NaN  23.4500           1
889       1  26.0  30.0000           0
890       3  32.0   7.7500           0

[891 rows x 4 columns]

In [9]:
features.isna().any()

Pclass        False
Age            True
Fare          False
Sex_female    False
dtype: bool

In [11]:
features.Age

0      22.0
1      38.0
2      26.0
3      35.0
4      35.0
       ...
886    27.0
887    19.0
888     NaN
889    26.0
890    32.0
Name: Age, Length: 891, dtype: float64

In [13]:
features.Age = features.Age.fillna(features.Age.mean())
features.Age.mean()

c:\users\yashm\appdata\local\programs\python\python38\lib\site-packages\pandas\core\generic.py:5208: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: http://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  self[name] = value

29.69911764705882

In [15]:
features[:10]

   Pclass        Age     Fare  Sex_female
0       3  22.000000   7.2500           0
1       1  38.000000  71.2833           1
2       3  26.000000   7.9250           1
3       1  35.000000  53.1000           1
4       3  35.000000   8.0500           0
5       3  29.699118   8.4583           0
6       1  54.000000  51.8625           0
7       3   2.000000  21.0750           0
8       3  27.000000  11.1333           1
9       2  14.000000  30.0708           1

In [61]:
from sklearn.model_selection import train_test_split

X_train, X_test, y_train, y_test = train_test_split(features, target, test_size=0.3)

In [69]:
from sklearn.naive_bayes import GaussianNB

model = GaussianNB()

In [70]:
model.fit(X_train, y_train)

GaussianNB(priors=None, var_smoothing=1e-09)

In [71]:
model.score(X_test, y_test)

0.7686567164179104

In [78]:

from sklearn.model_selection import cross_val_score

cross_val_score(GaussianNB(), features, target)

array([0.70949721, 0.79775281, 0.78089888, 0.75842697, 0.79213483])

In [79]:
y_test[:10]

18     0
506    1
87     0
47     1
455    1
680    0
23     1
706    1
457    1
640    0
Name: Survived, dtype: int64

In [82]:
model.predict(X_test[:10])

array([1, 1, 0, 1, 0, 1, 0, 1, 1, 0], dtype=int64)

In [84]:
model.score(X_test, y_test)

0.7686567164179104

In [86]:
model.predict_proba(X_test[:10])

array([[0.33467599, 0.66532401],
       [0.19508098, 0.80491902],
       [0.95730977, 0.04269023],
       [0.33306372, 0.66693628],
       [0.95695418, 0.04304582],
       [0.33326624, 0.66673376],
       [0.74218647, 0.25781353],
       [0.22587519, 0.77412481],
       [0.04484126, 0.95515874],
       [0.95195777, 0.04804223]])